Repository: sibskull/rosa-crypto-tool
Catalog: po/*/rosa-crypto-tool.po
Languages: ru

source: Information about the certificate:
ru: Информация о сертификате:

source: - Issuer:
ru: - Издатель:

source: - Subject:
ru: - Субъект:

source: - Serial:
ru: - Серийный номер:

source: - Signature Algorithm:
ru: - Алгоритм подписи:

source: - PublicKey Algorithm:
ru: - Алгоритм открытого ключа:

source: - Valid from
ru: - Действителен с:

source: to
ru: до

source: Choose file
ru: Выбрать файл

source: Signature's verified
ru: Подпись проверена

source: Please select the file to verify sign
ru: Пожалуйста, выберите файл для проверки подписи

source: This file is not a signature
ru: Этот файл не является файлом подписи

source: The file is separated
ru: Файл отделён от подписи

source: Please select the file sign to separated
ru: Пожалуйста, выберите файл для отделения его от подписи

source: Signed message is created
ru: Подписание файла выполнено

source: Please select the file to sign
ru: Пожалуйста, выберите файл для подписи

source: Certificate you want to sign the document is not installed. Please click on the button to install the certificate and try again
ru: Сертификат, которым вы хотите подписать файл, не установлен. Пожалуйста, кликните по кнопке "Установить сертификат" и повторите попытку.

source: The certificate was installed successfully
ru: Сертификат был успешно установлен

source: The installation failed. Please check for the token in the computer and try again
ru: Установка не удалась. Пожалуйста, проверьте наличие токена в компьютере и повторите попытку

source: - no longer valid
ru: - более не действителен

source: - using outdated signature scheme %s valid until 31 December 2018
ru: - использует устаревшую схему подписи %s действительную до 31 декабря 2018г.

source: WARNING: This certificate:
ru: ПРЕДУПРЕЖДЕНИЕ: Данный сертификат

source: - Token is not installed in the computer
ru: - Токен не установлен в компьютер

source: - CryptoPro is not installed in the computer
ru: - КриптоПро не установлен на компьютер

source: - PC/SC Smart Card Daemon is not running
ru: - PC/SC Smart Card Daemon не запущен

source: Warning
ru: Предупреждение

source: Discovered the following:
ru: Обнаружено следующее:

source: Information
ru: Информация

source: All the necessary components installed and working
ru: Все необходимые компоненты установлены и работают

source: This certificate:
ru: Данный сертификат:

source: &File
ru: &Файл

source: &Tools
ru: &Инструменты

source: &Help
ru: &Справка

source: &Choose File
ru: Выбрать файл

source: Choose file for sign or verify signature
ru: Выбрать файл для подписания или проверки подписи

source: &Exit
ru: &Выход

source: &Sign file
ru: &Подписать файл

source: Sign the selected file
ru: Подписать выбранный файл

source: &Check signature
ru: П&роверить подпись

source: Verify a signed file
ru: Проверить подпись выбранного файла

source: Split file
ru: Отделить файл

source: Separates the file from your signature
ru: Отделение файла от подписи

source: Check component program
ru: Проверка компонентов программы

source: Install certificate
ru: Установить сертификат

source: &About ROSA Crypto Tool
ru: &О программе ROSA Crypto Tool

source: Show
ru: Показать

source: Hide
ru: Скрыть

source: File:
ru: Файл:

source: Status operation:
ru: Статус операции:

source: Details:
ru: Подробности:

source: Choose
ru: Выбрать

source: Show or hide more information
ru: Показать или скрыть подробную информацию

source: ROSA Crypto Tool - program for working with electronic digital signature Authors: Michl Voznesensky Version: alpha License: BSD Copyright (c) 2016, LLC "NTC IT ROSA"
ru: ROSA Crypto Tool - программа для работы с электронной цифровой подписью Автор: Михаил Вознесенский Версия: альфа Лицензия: BSD Copyright (c) 2016, ООО «НТЦ ИТ РОСА»

source: About ROSA Crypto Tool
ru: О ROSA Crypto Tool
